<details>
  <summary>Plan for **Adarsh-Suvarna/digger-terraform-action#gcs**</summary>

  ```terraform
Terraform will perform the following actions:

  # module.cloud_bucket["learn-gcpdevops-private-registry-9845"].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "app" = "gcs"
          + "env" = "uat"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "learn-gcpdevops-private-registry-9845"
      + project                     = "learn-gcp-cloud-adarsh"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + encryption {
          + default_kms_key_name = "projects/learn-gcp-cloud-adarsh/locations/asia-south1/keyRings/test/cryptoKeys/test"
        }

      + logging {
          + log_bucket        = "newvm20-bucket"
          + log_object_prefix = (known after apply)
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_id        = [
      + (known after apply),
    ]
  + bucket_name      = [
      + "learn-gcpdevops-private-registry-9845",
    ]
  + bucket_self_link = [
      + (known after apply),
    ]
  + bucket_url       = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────
  ```
</details>